package com.mjc813.Repor6;

public class Main99 {
//    키보드의 1부터 9까지 숫자를 입력하여 엔터를 치면 그 숫자에 해당하는 구구단을 출력해야 한다.
//    다만 구구단 한 줄은 1초 간격으로 출력해야 한다.
//    1초 간격중에 키보드로 새로운 1부터 9까지의 숫자를 입력하여 엔터를 치면
//    새로운 숫자에 해당하는 구구단을 출력해야 한다. 물론 그 이전에 출력 중이던 구구단을 끝까지 출력해야 한다.
//            예:
//            2엔터
//		2 * 1 = 2
//                2 * 2 = 4
//                2 * 3 = 6
//                7엔터
//		7 * 1 = 7
//                2 * 4 = 8
//                7 * 2 = 14
//                2 * 5 = 10
//                4엔터
//		2 * 6 = 12
//                4 * 1 = 4
//                7 * 3 = 21
//                2 * 7 = 14
//                4 * 2 = 2
//                7 * 4 = 28
//                2 * 8 = 16
//                4 * 3 = 12
//                5엔터
//		5 * 1 = 50
//                7 * 5 = 35
//                2 * 9 = 18 (2단 종료 해야함) ()의 내용은 출력 안함
//		4 * 4 = 16
//                5 * 2 = 10
//                7 * 6 = 32
//    조건은 구구단 출력 스레드 클래스를 하나만 만들고
//    main 스레드에서 키보드 입력 받고 구구단 출력 스레드를 생성해서 실행해야 한다.
//    또 새로운 숫자가 키보드로 입력 되면 구구단 출력 스레드를 생성해서 실행해야 한다.
//    모든 행들은 1000ms 마다 출력되어야 한다.

}
